# Categorical Data

In [1]:
import pandas as pd

In [2]:
tit = pd.read_csv('../Course_Materials_Part2/Video_Lecture_NBs/titanic.csv')

In [3]:
tit.dropna(inplace=True)

In [4]:
tit.head()

    survived  pclass     sex   age  sibsp  parch     fare embarked deck
1          1       1  female  38.0      1      0  71.2833        C    C
3          1       1  female  35.0      1      0  53.1000        S    C
6          0       1    male  54.0      0      0  51.8625        S    E
10         1       3  female   4.0      1      1  16.7000        S    G
11         1       1  female  58.0      0      0  26.5500        S    C

In [5]:
tit.to_csv("titanic_clean.csv", index=False)

In [6]:
tit.nunique()

survived     2
pclass       3
sex          2
age         63
sibsp        4
parch        4
fare        93
embarked     3
deck         7
dtype: int64

In [8]:
tit[["sex", "embarked"]].describe()

         sex embarked
count    182      182
unique     2        3
top     male        S
freq      94      115

In [9]:
tit.sex = tit.sex.astype("category")

In [10]:
tit.embarked = tit.embarked.astype("category")

In [11]:
tit.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 182 entries, 1 to 889
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  182 non-null    int64
 1   pclass    182 non-null    int64
 2   sex       182 non-null    category
 3   age       182 non-null    float64
 4   sibsp     182 non-null    int64
 5   parch     182 non-null    int64
 6   fare      182 non-null    float64
 7   embarked  182 non-null    category
 8   deck      182 non-null    object
dtypes: category(2), float64(2), int64(4), object(1)
memory usage: 12.0+ KB

In [12]:
tit.sex.dtype

CategoricalDtype(categories=['female', 'male'], ordered=False)

In [13]:
tit

     survived  pclass     sex   age  sibsp  parch     fare embarked deck
1           1       1  female  38.0      1      0  71.2833        C    C
3           1       1  female  35.0      1      0  53.1000        S    C
6           0       1    male  54.0      0      0  51.8625        S    E
10          1       3  female   4.0      1      1  16.7000        S    G
11          1       1  female  58.0      0      0  26.5500        S    C
..        ...     ...     ...   ...    ...    ...      ...      ...  ...
871         1       1  female  47.0      1      1  52.5542        S    D
872         0       1    male  33.0      0      0   5.0000        S    B
879         1       1  female  56.0      0      1  83.1583        C    C
887         1       1  female  19.0      0      0  30.0000        S    B
889         1       1    male  26.0      0      0  30.0000        C    C

[182 rows x 9 columns]

In [14]:
tit.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 182 entries, 1 to 889
Data columns (total 9 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   survived  182 non-null    int64
 1   pclass    182 non-null    int64
 2   sex       182 non-null    category
 3   age       182 non-null    float64
 4   sibsp     182 non-null    int64
 5   parch     182 non-null    int64
 6   fare      182 non-null    float64
 7   embarked  182 non-null    category
 8   deck      182 non-null    object
dtypes: category(2), float64(2), int64(4), object(1)
memory usage: 12.0+ KB

In [15]:
tit.describe(include=["O"])

       deck
count   182
unique    7
top       C
freq     51